# PANDAS

# pandas serisi oluşturmak

In [1]:
import pandas as pd

In [4]:
pd.Series([1,32,3,4]) #seri değerleri ve indexleri beraber tutar.

0     1
1    32
2     3
3     4
dtype: int64

In [5]:
seri =pd.Series([1,32,3,4]) #seri değerleri ve indexleri beraber tutar.

In [6]:
type(seri)

pandas.core.series.Series

In [8]:
seri.axes # 4e kadar

[RangeIndex(start=0, stop=4, step=1)]

In [9]:
seri.dtype

dtype('int64')

In [12]:
seri.size

4

In [15]:
seri.ndim #boyut,arrays

1

In [16]:
seri.values

array([ 1, 32,  3,  4], dtype=int64)

In [17]:
seri.head()

0     1
1    32
2     3
3     4
dtype: int64

In [20]:
seri.head(3) #bas

0     1
1    32
2     3
dtype: int64

In [19]:
seri.tail(2) #sonn

2    3
3    4
dtype: int64

In [22]:
pd.Series([12,13,15,45,97], index =[12,25,31,21,32])

12    12
25    13
31    15
21    45
32    97
dtype: int64

In [24]:
pd.Series([12,13,15,45,97], index =["a","b","c","d","e"])

a    12
b    13
c    15
d    45
e    97
dtype: int64

In [27]:
seri=pd.Series([12,13,15,45,97], index =["a","b","c","d","e"])

In [28]:
seri["a"]

12

In [30]:
seri["a":"c"] #index bazında gecis

a    12
b    13
c    15
dtype: int64

# sozluk uzerinden liste olusturmak

In [33]:
sozluk =pd.Series({"reg":10,"loj":11,"cart":14})

In [34]:
sozluk

reg     10
loj     11
cart    14
dtype: int64

# iki seriyi birlestirirek seri olusturma

In [37]:
pd.concat([sozluk,sozluk]) #seriler tek bir array o yüzden alt alta eklememiz gerekiyo

reg     10
loj     11
cart    14
reg     10
loj     11
cart    14
dtype: int64

# eleman islemleri

In [39]:
import numpy as np
a =np.array([1,2,3,4,50])

In [41]:
seri =pd.Series(a)

In [42]:
seri

0     1
1     2
2     3
3     4
4    50
dtype: int32

In [43]:
seri[0]

1

In [44]:
seri[1:3]

1    2
2    3
dtype: int32

In [45]:
seri = pd.Series([123,245,654,544] , index =["reg","loj","rf","svr"])

In [47]:
seri

reg    123
loj    245
rf     654
svr    544
dtype: int64

In [48]:
seri.index

Index(['reg', 'loj', 'rf', 'svr'], dtype='object')

In [49]:
seri.keys

<bound method Series.keys of reg    123
loj    245
rf     654
svr    544
dtype: int64>

In [51]:
list(seri.items()) #key degerlerine karsılık gelen valueları beraber veriyo

[('reg', 123), ('loj', 245), ('rf', 654), ('svr', 544)]

In [52]:
seri.values

array([123, 245, 654, 544], dtype=int64)

# eleman sorgulama

In [53]:
"reg" in seri

True

In [54]:
"mal" in seri

False

In [55]:
seri["reg"]

123

# fancy eleman

In [56]:
seri[["rf","reg"]]

rf     654
reg    123
dtype: int64

In [57]:
seri ["reg"] =130

In [58]:
seri

reg    130
loj    245
rf     654
svr    544
dtype: int64

In [60]:
seri ["reg":"loj"]

reg    130
loj    245
dtype: int64

# pandas dataframe olusturma

yapısal bir veri tipi,numpy fixtype olduğu için veri tutup işlem yapmak zorlasıyor.bu sebeple pandas veri analizi ve manüpilasyonu acısından daha iyi.pandas daha analitik anlam,ml modellerine vericek olduğumuz veri setleri olarak düşünebilirz.

In [65]:
import pandas as pd

In [66]:
l = [1,2,32,56,12]
l

[1, 2, 32, 56, 12]

In [68]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2             32
3             56
4             12

In [70]:
import numpy as np
m =np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [72]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

# df isimlendirme

In [73]:
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [76]:
df.columns =("degis1","degis2","degis3")
df

   degis1  degis2  degis3
0       1       2       3
1       4       5       6
2       7       8       9

In [77]:
type(df)

pandas.core.frame.DataFrame

In [79]:
df.axes #0 dan 3 e kadar 1 er 1er gidiyor

[RangeIndex(start=0, stop=3, step=1),
 Index(['degis1', 'degis2', 'degis3'], dtype='object')]

In [80]:
df.shape

(3, 3)

In [82]:
df.ndim #pandasta hep 2 çünkü satır ve sütunlardan olusuyor.

2

In [84]:
df.size # eleman sayisi

9

In [85]:
df.values #dataframeden değerleri çekip ,numpy arrayi içine yerleştiriyor.

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [86]:
df.head()

   degis1  degis2  degis3
0       1       2       3
1       4       5       6
2       7       8       9

In [88]:
df.tail(1)

   degis1  degis2  degis3
2       7       8       9

In [89]:
a = np.array([1,2,3,4,5])

In [93]:
pd.DataFrame(a,columns = ["yeeapp"])

   yeeapp
0       1
1       2
2       3
3       4
4       5

# eleman islemleri

In [94]:
s1 =np.random.randint(10,size=5)
s2 =np.random.randint(10,size=5)
s3 =np.random.randint(10,size=5)

In [95]:
sozluk={"var1":s1,"var2":s2,"var3":s3} #sozluk üzerinden olusturuyoruz

In [96]:
sozluk

{'var1': array([7, 3, 0, 9, 7]),
 'var2': array([0, 2, 3, 8, 0]),
 'var3': array([9, 8, 7, 6, 3])}

In [98]:
df=pd.DataFrame(sozluk)

In [99]:
df

   var1  var2  var3
0     7     0     9
1     3     2     8
2     0     3     7
3     9     8     6
4     7     0     3

In [100]:
df[0:1]

   var1  var2  var3
0     7     0     9

In [101]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [102]:
df.index =["a","b","c","d","e"]

In [103]:
df

   var1  var2  var3
a     7     0     9
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [105]:
df["c":"e"]

   var1  var2  var3
c     0     3     7
d     9     8     6
e     7     0     3

# silme ----->>> silme islemini kaydetmek için atama veye "inplace" kullanabiliriz

In [107]:
df.drop("a",axis=0)#axis nedeni satırı almak istediğimizi söylemek için

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [108]:
df

   var1  var2  var3
a     7     0     9
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [112]:
a =df.drop("a",axis=0)#axis nedeni satırı almak istediğimizi söylemek için

In [113]:
a

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [114]:
df.drop("a",axis=0,inplace =True)#axis nedeni satırı almak istediğimizi söylemek için

In [115]:
df

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [118]:
l =["c","d"]

In [119]:
df.drop(l,axis =0)

   var1  var2  var3
b     3     2     8
e     7     0     3

# değişkenler için

In [120]:
"var1" in df

True

In [122]:
l =("var1","var4","var2")

In [123]:
for i in l:
    print(i in df)

True
False
True

In [124]:
df

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [125]:
df["var4"] = df["var1"] *df["var2"]

In [126]:
df

   var1  var2  var3  var4
b     3     2     8     6
c     0     3     7     0
d     9     8     6    72
e     7     0     3     0

# değişken silmek

In [128]:
df.drop("var4",axis=1)

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [129]:
df

   var1  var2  var3  var4
b     3     2     8     6
c     0     3     7     0
d     9     8     6    72
e     7     0     3     0

In [130]:
df.drop("var4",axis=1,inplace =True)

In [131]:
df

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

In [132]:
#fancy silme

In [133]:
l =["var1","var2"]

In [134]:
df.drop(l,axis =1)

   var3
b     8
c     7
d     6
e     3

In [135]:
df

   var1  var2  var3
b     3     2     8
c     0     3     7
d     9     8     6
e     7     0     3

# gözlem ve değişken değiştirme:LOC & ILOC

In [142]:
import numpy as np
import pandas as pd
m =np.random.randint(1,30,size = (10,3))
df =pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    26    18    27
1    15    17     8
2    16    13    22
3    16    13     8
4    22    10    10
5    13    12     2
6    17    22     4
7    25    25    25
8     9    19    25
9    14    13    18

In [145]:
?np.random.randint

Docstring:
randint(low, high=None, size=None, dtype='l')

Return random integers from `low` (inclusive) to `high` (exclusive).

Return random integers from the "discrete uniform" distribution of
the specified dtype in the "half-open" interval [`low`, `high`). If
`high` is None (the default), then results are from [0, `low`).

.. note::
    New code should use the ``integers`` method of a ``default_rng()``
    instance instead; see `random-quick-start`.

Parameters
----------
low : int or array-like of ints
    Lowest (signed) integers to be drawn from the distribution (unless
    ``high=None``, in which case this parameter is one above the
    *highest* such integer).
high : int or array-like of ints, optional
    If provided, one above the largest (signed) integer to be drawn
    from the distribution (see above for behavior if ``high=None``).
    If array-like, must contain integer values
size : int or tuple of ints, optional
    Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
    ``m * n * k`` samples are drawn.  Default is None, in which case a
    single value is returned.
dtype : dtype, optional
    Desired dtype of the result. All dtypes are determined by their
    name, i.e., 'int64', 'int', etc, so byteorder is not available
    and a specific precision may have different C types depending
    on the platform. The default value is `np.int_`.

    .. versionadded:: 1.11.0

Returns
-------
out : int or ndarray of ints
    `size`-shaped array of random integers from the appropriate
    distribution, or a single such random int if `size` not provided.

See Also
--------
random_integers : similar to `randint`, only for the closed
    interval [`low`, `high`], and 1 is the lowest value if `high` is
    omitted.
Generator.integers: which should be used for new code.

Examples
--------
>>> np.random.randint(2, size=10)
array([1, 0, 0, 0, 1, 1, 0, 0, 1, 0]) # random
>>> np.random.randint(1, size=10)
array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

Generate a 2 x 4 array of ints between 0 and 4, inclusive:

>>> np.random.randint(5, size=(2, 4))
array([[4, 0, 2, 1], # random
       [3, 2, 2, 0]])

Generate a 1 x 3 array with 3 different upper bounds

>>> np.random.randint(1, [3, 5, 10])
array([2, 2, 9]) # random

Generate a 1 by 3 array with 3 different lower bounds

>>> np.random.randint([1, 5, 7], 10)
array([9, 8, 7]) # random

Generate a 2 by 4 array using broadcasting with dtype of uint8

>>> np.random.randint([1, 3, 5, 7], [[10], [20]], dtype=np.uint8)
array([[ 8,  6,  9,  7], # random
       [ 1, 16,  9, 12]], dtype=uint8)
Type:      builtin_function_or_method

In [146]:
#loc:tanımlandığı sekliyle secim yapmak için kullanılır.indexi alır.

In [147]:
df.loc[0:3]

   var1  var2  var3
0    26    18    27
1    15    17     8
2    16    13    22
3    16    13     8

In [148]:
#iloc:alışık olduğumuz indexleme mantığıyla seçim yapar.
#son indexi almaz

In [149]:
df.iloc[0:3]

   var1  var2  var3
0    26    18    27
1    15    17     8
2    16    13    22

In [150]:
df.iloc[0,0]

26

In [151]:
df.iloc[:3,:2] #3satır 2 sütun getir

   var1  var2
0    26    18
1    15    17
2    16    13

In [152]:
df.loc[0:3,"var3"]

0    27
1     8
2    22
3     8
Name: var3, dtype: int32

# kosullu eleman islemleri

In [153]:
df["var1"]

0    26
1    15
2    16
3    16
4    22
5    13
6    17
7    25
8     9
9    14
Name: var1, dtype: int32

In [156]:
df[0:2][["var1","var2"]]

   var1  var2
0    26    18
1    15    17

In [158]:
df

   var1  var2  var3
0    26    18    27
1    15    17     8
2    16    13    22
3    16    13     8
4    22    10    10
5    13    12     2
6    17    22     4
7    25    25    25
8     9    19    25
9    14    13    18

In [163]:
df[df.var1 >15] #dataframe in içinden var1 i sec sonra kosul sagla

   var1  var2  var3
0    26    18    27
2    16    13    22
3    16    13     8
4    22    10    10
6    17    22     4
7    25    25    25

In [164]:
df[(df.var1 >15) & (df.var3<5)]

   var1  var2  var3
6    17    22     4

df.loc[(df.var1>15),["var1","var2"]] #değişkenleri loc ile aldık

In [172]:
df[(df.var1>15)][["var1","var2"]]#birden fazla değişken varsa iki tane köşeli parantez kullanırızzzzzzz.

   var1  var2
0    26    18
2    16    13
3    16    13
4    22    10
6    17    22
7    25    25

# join islemleri (birleştirme)

In [4]:
import numpy as np
import pandas as pd
m =np.random.randint(1,30,size = (5,3))
df1 =pd.DataFrame(m,columns=["var1","var2","var3"])
df1

   var1  var2  var3
0    29     8    14
1    27    29     5
2    22    27    27
3    18     4     8
4    13     9    26

In [5]:
df2 = df1 +99

In [6]:
df2

   var1  var2  var3
0   128   107   113
1   126   128   104
2   121   126   126
3   117   103   107
4   112   108   125

In [7]:
pd.concat([df1,df2]) #birlestirdi ama indexler değişmeli

   var1  var2  var3
0    29     8    14
1    27    29     5
2    22    27    27
3    18     4     8
4    13     9    26
0   128   107   113
1   126   128   104
2   121   126   126
3   117   103   107
4   112   108   125

In [8]:
pd.concat([df1,df2], ignore_index = True) #birlestirdi ama indexler değişmeli

   var1  var2  var3
0    29     8    14
1    27    29     5
2    22    27    27
3    18     4     8
4    13     9    26
5   128   107   113
6   126   128   104
7   121   126   126
8   117   103   107
9   112   108   125

In [9]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\berfim korkmaz\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [10]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [11]:
df2.columns =["var1","var2","deg3"]

In [12]:
df2

   var1  var2  deg3
0   128   107   113
1   126   128   104
2   121   126   126
3   117   103   107
4   112   108   125

In [13]:
df1

   var1  var2  var3
0    29     8    14
1    27    29     5
2    22    27    27
3    18     4     8
4    13     9    26

In [14]:
pd.concat([df1,df2], join ="inner") #kesişimlerine göre birlestirdi

   var1  var2
0    29     8
1    27    29
2    22    27
3    18     4
4    13     9
0   128   107
1   126   128
2   121   126
3   117   103
4   112   108

 # ileri birleştirme işlemleri

In [28]:
import pandas as pf

In [39]:
df1= pd.DataFrame({'calisanlar':['ali','veli','fatma','ayse'],
                  'grup': ['Muhasebe','Muhendislik','Muhendislik','Ik']})
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Muhendislik
2      fatma  Muhendislik
3       ayse           Ik

In [40]:
df2= pd.DataFrame({'calisanlar':['ali','veli','fatma','ayse'],
                  'ilk_giris': [2010,2011,2012,2013]})
df2

  calisanlar  ilk_giris
0        ali       2010
1       veli       2011
2      fatma       2012
3       ayse       2013

In [43]:
pd.merge(df1,df2) #birlestirme,ortak olana göre birlestirdi.

  calisanlar         grup  ilk_giris
0        ali     Muhasebe       2010
1       veli  Muhendislik       2011
2      fatma  Muhendislik       2012
3       ayse           Ik       2013

In [44]:
pd.merge(df1,df2, on ="calisanlar") #birlestirme,ortak olana göre birlestirdi.

  calisanlar         grup  ilk_giris
0        ali     Muhasebe       2010
1       veli  Muhendislik       2011
2      fatma  Muhendislik       2012
3       ayse           Ik       2013

# many to one

In [45]:
df3 =pd.merge(df1,df2)

In [46]:
df3

  calisanlar         grup  ilk_giris
0        ali     Muhasebe       2010
1       veli  Muhendislik       2011
2      fatma  Muhendislik       2012
3       ayse           Ik       2013

In [49]:
df4= pd.DataFrame({'grup': ['Muhasebe','Muhendislik','Muhendislik','Ik'],
                   'mudur':['ali','veli','fatma','ayse']
                  })
df4

          grup  mudur
0     Muhasebe    ali
1  Muhendislik   veli
2  Muhendislik  fatma
3           Ik   ayse

In [50]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris  mudur
0        ali     Muhasebe       2010    ali
1       veli  Muhendislik       2011   veli
2       veli  Muhendislik       2011  fatma
3      fatma  Muhendislik       2012   veli
4      fatma  Muhendislik       2012  fatma
5       ayse           Ik       2013   ayse

# many to many

In [52]:
df5= pd.DataFrame({'grup': ['Muhasebe','Muhendislik','Muhendislik','Ik','Muhasebe','Muhendislik','Muhendislik'],
                   'mudur':['sevme','toplama','sayma','kodlama','sevme','toplama','sayma']
                  })
df5

          grup    mudur
0     Muhasebe    sevme
1  Muhendislik  toplama
2  Muhendislik    sayma
3           Ik  kodlama
4     Muhasebe    sevme
5  Muhendislik  toplama
6  Muhendislik    sayma

In [53]:
df1

  calisanlar         grup
0        ali     Muhasebe
1       veli  Muhendislik
2      fatma  Muhendislik
3       ayse           Ik

In [54]:
pd.merge(df1,df5)

   calisanlar         grup    mudur
0         ali     Muhasebe    sevme
1         ali     Muhasebe    sevme
2        veli  Muhendislik  toplama
3        veli  Muhendislik    sayma
4        veli  Muhendislik  toplama
5        veli  Muhendislik    sayma
6       fatma  Muhendislik  toplama
7       fatma  Muhendislik    sayma
8       fatma  Muhendislik  toplama
9       fatma  Muhendislik    sayma
10       ayse           Ik  kodlama

# aggregation and grouping ----------->>> important

## basit toplulaştırma fonksiyonları

In [64]:
import seaborn as sns

In [65]:
? sns.load_dataset

Signature:  sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load a dataset from the online repository (requires internet).

Parameters
----------
name : str
    Name of the dataset (`name`.csv on
    https://github.com/mwaskom/seaborn-data).  You can obtain list of
    available datasets using :func:`get_dataset_names`
cache : boolean, optional
    If True, then cache data locally and use the cache on subsequent calls
data_home : string, optional
    The directory in which to cache data. By default, uses ~/seaborn-data/
kws : dict, optional
    Passed to pandas.read_csv
File:      c:\users\berfim korkmaz\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [71]:
df =sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [74]:
df.shape # gözlem ve degiskenbb

(1035, 6)

In [76]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [77]:
df["mass"].mean()#mass = degisken

2.6381605847953233

In [78]:
df["mass"].count()

513

In [79]:
df["mass"].min()

0.0036

In [82]:
df["mass"].var()

14.58183312700122

In [80]:
df["mass"].sum()

1353.37638

In [83]:
df["mass"].std()

3.8186166509616046

In [84]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [86]:
df.describe().T #transpose unu aldık

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [90]:
df.dropna().describe().T # eksik değerler olursa siler.vei seti değişti yani eksik değerler var.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

# gruplama islemleri

In [97]:
df = pd.DataFrame({'gruplar':['A','B','C','A','B','C'],
                  'veri': [10,11,12,13,14,15]} ,columns=['gruplar','veri'])

In [99]:
df # A sınıfından birinin notu 10

  gruplar  veri
0       A    10
1       B    11
2       C    12
3       A    13
4       B    14
5       C    15

In [101]:
df.groupby("gruplar")#obje olustu.gruplar değişkeninin içinde yer alan kategori sınıflarını tuttu.ama napıcağını bilmiyor.

In [103]:
df.groupby("gruplar").mean() #grupları yakaladık ve aggregationla birleştirdik.

         veri
gruplar
A        11.5
B        12.5
C        13.5

In [105]:
df =sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [106]:
df.groupby("method") #grupladımm

In [110]:
df.groupby("method")["orbital_period"]#neye göre grupladım

In [112]:
df.groupby("method")["orbital_period"].mean() #gruplara naptım

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [117]:
df.groupby("method")["mass"].mean() #gruplara naptım

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

# İLERİ TOPLULAŞTIRMA( aggregate,filter,transform,apply)

# AGGREGATE

In [121]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'variable1':[12,42,14,15,87,69],
                  'variable2':[114,878,658,4215,4524,365]},columns =['groups','variable1','variable2'])
df

  groups  variable1  variable2
0      A         12        114
1      B         42        878
2      C         14        658
3      A         15       4215
4      B         87       4524
5      C         69        365

In [123]:
df.groupby("groups")

In [124]:
df.groupby("groups").mean()

        variable1  variable2
groups
A            13.5     2164.5
B            64.5     2701.0
C            41.5      511.5

In [132]:
import pandas as pd#tırnakla yaz,normalide kabul ediyor ama ayırt etmek de fayda var.
import numpy as np#kütüphaneyi belirt
df.groupby("groups").aggregate(["min",np.median,"max"])

       variable1            variable2
             min median max       min  median   max
groups
A             12   13.5  15       114  2164.5  4215
B             42   64.5  87       878  2701.0  4524
C             14   41.5  69       365   511.5   658

In [137]:
df.groupby("groups").aggregate({"variable1":"min","variable2": "max"})

        variable1  variable2
groups
A              12       4215
B              42       4524
C              14        658

# FILTER

In [121]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'variable1':[12,42,14,15,87,69],
                  'variable2':[114,878,658,4215,4524,365]},columns =['groups','variable1','variable2'])
df

  groups  variable1  variable2
0      A         12        114
1      B         42        878
2      C         14        658
3      A         15       4215
4      B         87       4524
5      C         69        365

In [139]:
def filter_func(x):                                 #variable1 için std si 9 dan büyük olanları al filtreleme fonksiyonu yazdık.
    return x["variable1"].std ()  >9

In [142]:
df.groupby("groups").filter(filter_func)

  groups  variable1  variable2
1      B         42        878
2      C         14        658
4      B         87       4524
5      C         69        365

In [147]:
def filter_func(x):
    return x["variable2"] .mean() >4 and  x["variable2"].std()>9

In [148]:
df.groupby("groups").filter (filter_func)

  groups  variable1  variable2
0      A         12        114
1      B         42        878
2      C         14        658
3      A         15       4215
4      B         87       4524
5      C         69        365

# transform

In [150]:
df["variable1"]*9

0    108
1    378
2    126
3    135
4    783
5    621
Name: variable1, dtype: int64

In [159]:
df_a =df.iloc[:,1:3]

In [162]:
df_a.transform(lambda x: x -(x.mean())/ x.std())

   variable1    variable2
0  10.757491   113.110658
1  40.757491   877.110658
2  12.757491   657.110658
3  13.757491  4214.110658
4  85.757491  4523.110658
5  67.757491   364.110658

# APPLY ------------------>>>>>>>değişkenlerin üzerinde gezinebiliyor ve toplulaştırma amacıyla kullanılacak olan fonksiyondur.

In [170]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'variable1':[12,42,14,15,87,69],
                  'variable2':[114,878,658,4215,4524,365]},columns =['groups','variable1','variable2'])
df

  groups  variable1  variable2
0      A         12        114
1      B         42        878
2      C         14        658
3      A         15       4215
4      B         87       4524
5      C         69        365

In [171]:
df.apply(np.sum)

groups       ABCABC
variable1       239
variable2     10754
dtype: object

In [173]:
df.groupby("groups").apply(np.sum)

       groups  variable1  variable2
groups
A          AA         27       4329
B          BB        129       5402
C          CC         83       1023

In [175]:
df.groupby("groups").apply(np.mean)

        variable1  variable2
groups
A            13.5     2164.5
B            64.5     2701.0
C            41.5      511.5

In [176]:
df.apply(np.sum)

groups       ABCABC
variable1       239
variable2     10754
dtype: object

# pivot tablolar

In [177]:
import pandas as pd
import seaborn as sns
titanic =sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [180]:
titanic.groupby("sex")["survived"].mean() #cinsiyete göre sıralayıp yasamasının ortalamasını aldı.

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

# köşeli parantezle   tablo seklini aldı.

In [183]:
titanic.groupby("sex")[["survived"]].mean() #cinsiyete göre sıralayıp yasamasının ortalamasını aldı.

        survived
sex
female  0.742038
male    0.188908

In [192]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()
#her class ta cinsiyete göre yasama ortalamsını aldık.

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# pivot ile table

In [195]:
titanic.pivot_table("survived",index ="sex",columns ="class") #gözlem birimi, satır =index

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [197]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [198]:
age=pd.cut(titanic["age"],[0,18,90])
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [199]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663